# MoreThanOneDimsLabelToOneReportingParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..MoreThanOneDimsLabelToOneReportingParameter Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Reporting parameters can only exist on a single dimension/constraint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MoreThanOneDimsLabelToOneReportingParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MoreThanOneDimsLabelToOneReportingParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MoreThanOneDimsLabelToOneReportingParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace